In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [3]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [4]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

# Merge Like SQL: pd.merge()
Inner Join (default)

In [6]:
pd.merge(employees, departments, on="DeptID") #Inner join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [7]:
pd.merge(employees, departments, on="DeptID", how="right") #Right join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [8]:
pd.merge(employees, departments, on="DeptID", how="left") #Left join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [9]:
pd.merge(employees, departments, on="DeptID", how="outer") #Outer join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

# Concatenating DataFrames
- Use pd.concat() to stack datasets either vertically or horizontally.

In [16]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Score": [89, 87]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "Age": [31, 26]})

In [17]:
pd.concat([df1, df2]) # Vertically by default

      Name  Score   Age
0    Alice   89.0   NaN
1      Bob   87.0   NaN
0  Charlie    NaN  31.0
1    David    NaN  26.0

In [18]:
pd.concat([df1, df2], axis=1) # Horizontally

    Name  Score     Name  Age
0  Alice     89  Charlie   31
1    Bob     87    David   26